//玛恩纳又在摸鱼！！
#include<stdio.h>

int main()
{
    int n,m;
    scanf("%d%d",&n,&m);    //输入行数和列数

    char h[n][m];

    // 输入雷区并初始化非雷区为 '0'
    for (int i = 0; i < n; i++)
    {
        scanf("%s", h[i]);
        for (int j = 0; j < m; j++)
        {
            if (h[i][j] != '*')
            {
                h[i][j] = '0';  // 初始化非雷区为 '0'
            }
        }
    }

    for(int i=0;i<n;i++)    //扫描行
    {
        for(int u=0;u<m;u++)    //扫描列
        {
            if(h[i][u]=='*')     //遇到‘雷’则以‘雷’为中心，检查‘雷’周围八个位置的情况
            {
                if(i-1>=0)      //开始检查‘雷’上方，防止此时为第一行
                {
                    if(u-1>=0)      //防止此时为第一列
                    {
                        if(h[i-1][u-1]!='*')    //‘雷’左上方不为‘雷’，则计数加一
                        {
                            h[i-1][u-1]++;      //计数加一
                        }
                    }
                    if(h[i-1][u]!='*')          //‘雷’上方不为‘雷’
                    {
                        h[i-1][u]++;
                    }
                    if(u+1<=m-1)            //防止此时为最末行
                    {
                        if(h[i-1][u+1]!='*')    //‘雷’右上方不为‘雷’
                        {
                            h[i-1][u+1]++;
                        }
                    }
                }
                    if(i+1<=n-1)           //开始检查‘雷’下方
                    {
                        if(u-1>=0)          //防止此时为第一列
                        {
                            if(h[i+1][u-1]!='*')        //‘雷’左下方不为‘雷’
                            {
                                h[i+1][u-1]++;
                            }
                        }
                        if(h[i+1][u]!='*')              //‘雷’下方不为‘雷’
                        {
                            h[i+1][u]++;
                        }
                        if(u+1<=m-1)            //防止此时为最后一列
                        {
                            if(h[i+1][u+1]!='*')        //‘雷’右下方不为‘雷’
                            {
                                h[i+1][u+1]++;
                            }
                        }
                    }
                if(u-1>=0)          //开始检查‘雷’左右
                {
                if(h[i][u-1]!='*')      //‘雷’左边不为‘雷’
                {
                    h[i][u-1]++;
                }
                }
                if(u+1<=m-1)            //‘雷’右边不为‘雷’
                {
                if(h[i][u+1]!='*')
                {
                    h[i][u+1]++;
                }
                }
            }
        }
    }

    for(int i=0;i<n;i++)   //逐行打印结果
    {
        for(int u=0;u<m;u++)
        {
            printf("%c",h[i][u]);
        }
        printf("\n");
    }
}
