//强迫症
#include<stdio.h>

int main()
{
    int n;
    scanf("%d",&n);     //获取正整数n长度
    if(!(n>=1&&n<=1000))    //保证1<=n<=1000
    {
        return 1;
    }

    char num[1][n];         //二进制串n

    scanf("%s",num[1]);      //获取

    int point=0;        //操作次数 point

        for(int i=0;i<n;i++)        //逐位扫描
        {
            if(i-1>=0)              //防止此时为第一位数字
            {
                if(i+1<=n)          //防止此时为末位数字
                {
                    if(num[1][i-1]=='1'&&num[1][i]=='1'&&num[1][i+1]=='1')//三位三位处理
                    {
                        point++;            //先检查为‘111’类似三位数字
                        num[1][i]='0';       //将中间的‘1’转为‘0’，则满足不连续出现同个数字
                    }
                    else if(num[1][i-1]=='0'&&num[1][i]=='0'&&num[1][i+1]=='0')
                    {
                        point++;                //类似的检查‘000’
                        num[1][i]='1';          //将中间的‘0’转为‘1’
                    }
                    if(num[1][i-1]=='1'&&num[1][i]=='1')//两位两位处理，此时为‘11’
                    {
                        if(i==0||i==1)      //当此时为第一位或第二位数字
                        {
                           point++;
                            num[1][i-1]='0';    //将左边（第一位）由’1‘转化为’0‘
                        }
                        else if(i==n)           //当此时为末位数字
                        {
                            point++;
                            num[1][i]='0';          //将末位由’1‘转化为’0‘
                        }
                        else if(i>=2)               //处理中间位的数字
                        {
                            if(num[1][i-2]=='0')        //若左隔位为’0‘，则需避免出现左边变’0‘后出现’001‘
                            {
                                point++;
                                num[1][i]='0';          //将中间的’11‘中，右边的’1‘转化为’0‘
                            }
                        }
                    }
                    else if(num[1][i-1]=='0'&&num[1][i]=='0')       //下面同理，都为处理’00‘的情况
                    {
                        if(i==0||i==1)
                        {
                           point++;
                            num[1][i-1]='1';
                        }
                        else if(i==n)
                        {
                            point++;
                            num[1][i]='1';
                        }
                        else if(i>=2)
                        {
                            if(num[1][i-2]=='1')
                            {
                                point++;
                                num[1][i]='1';
                            }
                        }
                    }
                }
            }
        }
    printf("%d",point);     //打印结果，上述每操作一次 point就+1
}
